Ran Plan for dir: `opentofu` workspace: `prod`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/tofu plan -input=false -refresh -out "/atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu/prod-prod.tfplan" -var-file ./env/prod.tfvars -var environment=prod -var-file /atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu/env/prod.tfvars' in '/atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu': exit status 1
data.mongodbatlas_roles_org_id.org: Reading...
data.mongodbatlas_roles_org_id.org: Read complete after 0s [id=658b082bf98c657b2c969a5b]
data.mongodbatlas_team.teams["developers"]: Reading...
data.mongodbatlas_team.teams["devops"]: Reading...
data.mongodbatlas_team.teams["devops"]: Read complete after 1s [id=aWQ=:NjVkNGY1MTdlMDk4OTM3NDY2ZmEzZTdm-b3JnX2lk:NjU4YjA4MmJmOThjNjU3YjJjOTY5YTVi]
data.mongodbatlas_team.teams["developers"]: Read complete after 1s [id=aWQ=:NjVkNGEzYmVlNTA3ODQwNTY3OGJiZmUz-b3JnX2lk:NjU4YjA4MmJmOThjNjU3YjJjOTY5YTVi]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.hetzner-vps.hcloud_firewall.firewall will be created
  + resource "hcloud_firewall" "firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "firewall"

      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "5432"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # module.hetzner-vps.hcloud_primary_ip.primary_ip will be created
  + resource "hcloud_primary_ip" "primary_ip" {
      + assignee_id       = (known after apply)
      + assignee_type     = "server"
      + auto_delete       = false
      + datacenter        = (known after apply)
      + delete_protection = false
      + id                = (known after apply)
      + ip_address        = (known after apply)
      + ip_network        = (known after apply)
      + name              = "primary_ip"
      + type              = "ipv4"
    }

  # module.hetzner-vps.hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = true
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-12"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = (known after apply)
      + name                       = "postgres"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = false
        }
    }

  # module.hetzner-vps.hcloud_ssh_key.ssh_key["ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHz/h+WzkR+AZYNvfzdbp/lUFIqdew+xErtSirm1XhPS"] will be created
  + resource "hcloud_ssh_key" "ssh_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + labels      = {}
      + name        = "Jared"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHz/h+WzkR+AZYNvfzdbp/lUFIqdew+xErtSirm1XhPS"
    }

  # module.mongodb.mongodbatlas_cluster.cluster["discord-bot"] will be created
  + resource "mongodbatlas_cluster" "cluster" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = (known after apply)
      + backing_provider_name                            = "AZURE"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = false
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = "REPLICASET"
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = (known after apply)
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = (known after apply)
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "discord-bot"
      + num_shards                                       = (known after apply)
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = (known after apply)
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "EUROPE_NORTH"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = (known after apply)
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)

      + advanced_configuration (known after apply)

      + bi_connector_config (known after apply)

      + replication_specs (known after apply)
    }

  # module.mongodb.mongodbatlas_project.project will be created
  + resource "mongodbatlas_project" "project" {
      + cluster_count                                    = (known after apply)
      + created                                          = (known after apply)
      + id                                               = (known after apply)
      + ip_addresses                                     = (known after apply)
      + is_collect_database_specifics_statistics_enabled = (known after apply)
      + is_data_explorer_enabled                         = (known after apply)
      + is_extended_storage_sizes_enabled                = (known after apply)
      + is_performance_advisor_enabled                   = (known after apply)
      + is_realtime_performance_panel_enabled            = (known after apply)
      + is_schema_advisor_enabled                        = (known after apply)
      + is_slow_operation_thresholding_enabled           = (known after apply)
      + name                                             = "prod"
      + org_id                                           = "658b082bf98c657b2c969a5b"
      + region_usage_restrictions                        = (known after apply)
      + with_default_alerts_settings                     = true

      + teams {
          + role_names = [
              + "GROUP_OWNER",
            ]
          + team_id    = "65d4f517e098937466fa3e7f"
        }
      + teams {
          + role_names = [
              + "GROUP_READ_ONLY",
            ]
          + team_id    = "65d4a3bee5078405678bbfe3"
        }
    }

  # module.mongodb.mongodbatlas_project_ip_access_list.ip_access_list["0.0.0.0/0"] will be created
  + resource "mongodbatlas_project_ip_access_list" "ip_access_list" {
      + aws_security_group = (known after apply)
      + cidr_block         = "0.0.0.0/0"
      + comment            = "ip address for accessing project"
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + project_id         = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
╷
│ Error: [FATAL] Failed to create MinIO client (client_creation): failed to create S3 client: Endpoint: ... does not follow ip address or domain name standards.
│ 
│   with provider["registry.opentofu.org/aminueza/minio"],
│   on provider.tf line 3, in provider "minio":
│    3: provider "minio" {
│ 
╵


```
</details>